IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/I2C0_I2C0.xml
<module name="I2C0_I2C0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="I2C0_ICOAR" acronym="I2C0_ICOAR" offset="0x0" width="32" description="">
		<bitfield id="A9_A0" width="10" begin="9" end="0" resetval="0x0" description="Own address. Use in both 7- and 10-bit address mode. Note  that usercan program the I2C own address to any value as  long as it does notconflict with other components in the  system." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C0_ICIMR" acronym="I2C0_ICIMR" offset="0x4" width="32" description="">
		<bitfield id="AAS" width="1" begin="6" end="6" resetval="0x0" description="Address As Slave interrupt mask bit. Setting a'1' to this  bit unmasks the Address As Slave interrupt. Setting a'0' to  this bit masks the Address As Slave interrupt." range="6" rwaccess="RW"/> 
		<bitfield id="SCD" width="1" begin="5" end="5" resetval="0x0" description="Stop Condition Detection mask bit. Setting a'1' to this bit  unmasks the Stop Condition Detection interrupt. Setting a '0' to this bit masks the Stop Condition Detection  interrupt." range="5" rwaccess="RW"/> 
		<bitfield id="ICXRDY" width="1" begin="4" end="4" resetval="0x0" description="Transmit Data Ready interrupt mask bit. Setting a'1' to  this bit unmasks the Transmit Data Ready interrupt. Setting  a'0' to this bit masks the Transmit Data Ready interrupt." range="4" rwaccess="RW"/> 
		<bitfield id="ICRRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive Data Ready interrupt mask bit. Setting a'1' to this  bit unmasks the Receive Data Ready interrupt. Setting a'0'  to this bit masks the Receive Data Ready interrupt." range="3" rwaccess="RW"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register access ready interrupt mask bit. Setting a'1' to  this bit unmasks the Register access ready interrupt.  Setting a'0' to this bit masks the Register access ready  interrupt." range="2" rwaccess="RW"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No Acknowledgement interrupt mask bit. Setting a'1' to this  bit unmasks the No Acknowledgement interrupt. Setting a'0'  to this bit masks the No Acknowledgement interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration Lost interrupt mask bit. Setting a'1' to this  bit unmasks the Arbitration Lost interrupt. Setting a'0' to  this bit masks the Arbitration Lost interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C0_ICSTR" acronym="I2C0_ICSTR" offset="0x8" width="32" description="">
		<bitfield id="SDIR" width="1" begin="14" end="14" resetval="0x0" description="Slave Direction.  This bit is clear to '0' indicating the I2C is a master  transmitter/receiver or a slave receiver. This bit is also  clear by  STOP condition or START condition. It is set to '1' when the  I2C  slave is a transmitter. In DLB mode (which the configuration  should be master-transmitter slave-receiver) this bit is  clear to  '0'. Writing a'1' to this bit to clear it." range="14" rwaccess="RW"/> 
		<bitfield id="NACKSNT" width="1" begin="13" end="13" resetval="0x0" description="A No Acknowledge is sent due to NACKMOD is set to a'1'.  NACKSNT =0: A No Acknowledge is not sent. NACKSNT =1: A No  Acknowledge is sent.  Writing a'1' to this bit to clear it." range="13" rwaccess="RW"/> 
		<bitfield id="BB" width="1" begin="12" end="12" resetval="0x0" description="Bus Busy. This bit indicates the state of the serial bus.  BB=0: The bus is free.  BB=1: The bus is occupied.  On reception of a'start' condition the device sets BB to  1. This  bit is also set if the I2C detects SCL low state.  BB is clear to 0 after reception of a'stop' condition.  BB is kept to'0' regardless SCL state when the I2C is in  reset  (IRS_=0). If the IRS_ is set to'1' during transaction  between  other I2C devices the BB bit is set at the first falling  edge of SCL  or START condition. - (RW  )" range="12" rwaccess="RW"/> 
		<bitfield id="RSFULL" width="1" begin="11" end="11" resetval="0x0" description="Receive shift full. This bit indicates whether the receiver  has  experienced overrun. Overrun occurs when the receive shift  register (ICRSR) is full and ICDRR has not been read since  the  ICRSR-to-ICDRR transfer. The FSM is holding for ICDRR read  access.  RSFULL is clear when reading the ICDRR.  RSFULL is set to'1' when the I2C has recognized an overrun.  The contents of ICDRR are NOT lost in this case.  In repeat mode since double buffer (ICRSR and ICDRR)  behaves like a single buffer RSFULL is set to'1' every  time the  data is received.  RSFULL is clear as a result of reading the ICDRR. - (RW  )" range="11" rwaccess="RW"/> 
		<bitfield id="XSMT" width="1" begin="10" end="10" resetval="0x0" description="Transmit shift empty not. This bit indicates whether the  transmitter has experienced underflow. Underflow occurs when  the transmit shift register (ICXSR) is empty and ICDXR has  not  been loaded. The FSM is holding for ICDXR write access.  XSMT_ is cleared when underflow has occurred.  XSMT_ is set to'1' as a result of writing to ICDXR.  In repeat mode if the I2C in master transmitter mode is  holding  transfer with XSMT_=0 (i.e. waiting for further action) and  the  STT or STP bit is set XSMT_ is set to'1' by hardware." range="10" rwaccess="RW"/> 
		<bitfield id="AAS" width="1" begin="9" end="9" resetval="0x0" description="Address As Slave. This bit is set to 1 by the device when it  has  recognized its own slave address or an address of all (8)  zeros.  The AAS bit is reset by stop condition or detection of any  address byte that does not match ICOAR. - (RW  )" range="9" rwaccess="RW"/> 
		<bitfield id="AD0" width="1" begin="8" end="8" resetval="0x0" description="Address Zero Status: This bit is set to 1 by device if it  detects the  address of all (8) zeros (i.e. general call). The AD0 bit is  reset to  0 (default value) when a'start' or'stop' condition is  detected. - (RW  )" range="8" rwaccess="RW"/> 
		<bitfield id="SCD" width="1" begin="5" end="5" resetval="0x0" description="Stop Condition Detection bit  SCD is set when the I2C sends or receives STOP condition.  This  bit is cleared by reading ICIVR (as 110) or writing '1' to  itself." range="5" rwaccess="RW"/> 
		<bitfield id="ICXRDY" width="1" begin="4" end="4" resetval="0x0" description="Transmit Data Ready interrupt flag bit.  ICXRDY is set to'1' is generated when the transmitted data  has been copied from ICDXR to the transmit-shift register  (ICXSR).  ICRXDY is clear to'0' when the ICDXR is written. This bit  can  also be polled by the CPU to write a new transmitted data  into  the ICDXR.  Write '1' to this bit will set it and DXR Write will clear  it." range="4" rwaccess="RW"/> 
		<bitfield id="ICRRDY" width="1" begin="3" end="3" resetval="0x0" description="Receive Data Ready interrupt flag bit.  ICRRDY is set to'1' when the received data has been copied  from ICRSR into the ICDRR. ICRRDY is cleared to'0' when the  ICDRR is read. This bit can also be polled by the CPU to read  the received data in the ICDRR.  Write '1' or DRR Read will clear it." range="3" rwaccess="RW"/> 
		<bitfield id="ARDY" width="1" begin="2" end="2" resetval="0x0" description="Register-access-ready interrupt flag bit.  ARDY is generated by the hardware if the I2C is in the  master  mode when the previously programmed data and command has  been performed and status bit has been updated. This flag is  used by the CPU to let it knows that the I2C registers are  ready  to be accessed again.  When RM=0 ARDY is set when the internal data count is  passed 0 if STP register bit has not been set.  When RM=1 ARDY is set at each byte end. If the I2C is in FDF  mode(FDF=1) ARDY is set just after Start condition.  This bit is automatically cleared by hardware when writing  data  to ICDXR in transmit mode reading data from ICDRR in receive  mode or setting STT or STP bit.  Write '1' will clear it." range="2" rwaccess="RW"/> 
		<bitfield id="NACK" width="1" begin="1" end="1" resetval="0x0" description="No-Acknowledgement interrupt flag bit.  The No Acknowledge flag bit is set when the hardware in 'master' mode detects no acknowledge has been received.  This bit is NOT set by no-acknowledgement after Start byte  Write '1' or Read the ICIVR (as 010) will clear it." range="1" rwaccess="RW"/> 
		<bitfield id="AL" width="1" begin="0" end="0" resetval="0x0" description="Arbitration-Lost interrupt flag bit.  The Arbitration Lost flag bit is set to 1 when the device in  the 'master' mode senses it has lost an arbitration when two or  more  transmitters start a transmission almost simultaneously or  when  the I2C attempts to start a transfer while BB (bus busy) is  1.  When this is set to 1 due to arbitration lost the  MST/STT/STP  bits are clear the I2C becomes a slave.  Write '1' or Read the ICIVR (as 001) will clear it." range="0" rwaccess="RW"/>
	</register>
	<register id="I2C0_ICCLKL" acronym="I2C0_ICCLKL" offset="0xC" width="32" description="">
		<bitfield id="ICCL15_ICCL0" width="16" begin="15" end="0" resetval="0x0" description="Low time I 2 C SCL Clock Division Factor. They are used to  divide down the master clock to create the SCL low time  transition frequency. This register must be configured while  the I2C is still in reset (IRS_=0)." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C0_ICCLKH" acronym="I2C0_ICCLKH" offset="0x10" width="32" description="">
		<bitfield id="ICCH15_ICCLH0" width="16" begin="15" end="0" resetval="0x0" description="High time I 2 C SCL Clock Division Factor. They are used to  divide down the master clock to create the SCL high time  transition frequency. This register must be configured while  the I2C is still in reset (IRS_=0)." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C0_ICCNT" acronym="I2C0_ICCNT" offset="0x14" width="32" description="">
		<bitfield id="ICDC15_ICDC0" width="16" begin="15" end="0" resetval="0x0" description="Data count. This data count register is used to generate a  Stop condition if a Stop condition is specified (STP=1). .  ICCNT=1 data count is 1  ::::::::::::::::::::::::::::::::::::::::::::  ::::::::::::::::::::::::::::::::::::::::::::  ICCNT=0FFFFh data count is 65535  ICCNT=0data counter is 65536  Note that ICCNT is a don't care when RM is set to 1." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="I2C0_ICDRR" acronym="I2C0_ICDRR" offset="0x18" width="32" description="">
		<bitfield id="D7_D0" width="8" begin="7" end="0" resetval="0x0" description="Receive data" range="7 - 0" rwaccess="RW"/>
	</register>
